Infineon/mtb-xmclib-cat3/CMSIS/Infineon/COMPONENT_XMC4402/Include/XMC4402.h
/* ---------------------------  SCU_HIBERNATE_OSCULSTAT  -------------------------- */
#define SCU_HIBERNATE_OSCULSTAT_X1D_Pos       (0UL)                     /*!< SCU_HIBERNATE OSCULSTAT: X1D (Bit 0)                        */
#define SCU_HIBERNATE_OSCULSTAT_X1D_Msk       (0x1UL)                   /*!< SCU_HIBERNATE OSCULSTAT: X1D (Bitfield-Mask: 0x01)          */

/* ---------------------------  SCU_HIBERNATE_OSCULCTRL  -------------------------- */
#define SCU_HIBERNATE_OSCULCTRL_X1DEN_Pos     (0UL)                     /*!< SCU_HIBERNATE OSCULCTRL: X1DEN (Bit 0)                      */
#define SCU_HIBERNATE_OSCULCTRL_X1DEN_Msk     (0x1UL)                   /*!< SCU_HIBERNATE OSCULCTRL: X1DEN (Bitfield-Mask: 0x01)        */
#define SCU_HIBERNATE_OSCULCTRL_MODE_Pos      (4UL)                     /*!< SCU_HIBERNATE OSCULCTRL: MODE (Bit 4)                       */
#define SCU_HIBERNATE_OSCULCTRL_MODE_Msk      (0x30UL)                  /*!< SCU_HIBERNATE OSCULCTRL: MODE (Bitfield-Mask: 0x03)         */

/* ---------------------------  SCU_HIBERNATE_LPACCONF  --------------------------- */
#define SCU_HIBERNATE_LPACCONF_CMPEN_Pos      (0UL)                     /*!< SCU_HIBERNATE LPACCONF: CMPEN (Bit 0)                       */
#define SCU_HIBERNATE_LPACCONF_CMPEN_Msk      (0x7UL)                   /*!< SCU_HIBERNATE LPACCONF: CMPEN (Bitfield-Mask: 0x07)         */
#define SCU_HIBERNATE_LPACCONF_TRIGSEL_Pos    (4UL)                     /*!< SCU_HIBERNATE LPACCONF: TRIGSEL (Bit 4)                     */
#define SCU_HIBERNATE_LPACCONF_TRIGSEL_Msk    (0x70UL)                  /*!< SCU_HIBERNATE LPACCONF: TRIGSEL (Bitfield-Mask: 0x07)       */
#define SCU_HIBERNATE_LPACCONF_CONVDEL_Pos    (12UL)                    /*!< SCU_HIBERNATE LPACCONF: CONVDEL (Bit 12)                    */
#define SCU_HIBERNATE_LPACCONF_CONVDEL_Msk    (0x1000UL)                /*!< SCU_HIBERNATE LPACCONF: CONVDEL (Bitfield-Mask: 0x01)       */
#define SCU_HIBERNATE_LPACCONF_INTERVCNT_Pos  (16UL)                    /*!< SCU_HIBERNATE LPACCONF: INTERVCNT (Bit 16)                  */
#define SCU_HIBERNATE_LPACCONF_INTERVCNT_Msk  (0xfff0000UL)             /*!< SCU_HIBERNATE LPACCONF: INTERVCNT (Bitfield-Mask: 0xfff)    */
#define SCU_HIBERNATE_LPACCONF_SETTLECNT_Pos  (28UL)                    /*!< SCU_HIBERNATE LPACCONF: SETTLECNT (Bit 28)                  */
#define SCU_HIBERNATE_LPACCONF_SETTLECNT_Msk  (0xf0000000UL)            /*!< SCU_HIBERNATE LPACCONF: SETTLECNT (Bitfield-Mask: 0x0f)     */

/* ----------------------------  SCU_HIBERNATE_LPACTH0  --------------------------- */
#define SCU_HIBERNATE_LPACTH0_VBATLO_Pos      (0UL)                     /*!< SCU_HIBERNATE LPACTH0: VBATLO (Bit 0)                       */
#define SCU_HIBERNATE_LPACTH0_VBATLO_Msk      (0x3fUL)                  /*!< SCU_HIBERNATE LPACTH0: VBATLO (Bitfield-Mask: 0x3f)         */
#define SCU_HIBERNATE_LPACTH0_VBATHI_Pos      (8UL)                     /*!< SCU_HIBERNATE LPACTH0: VBATHI (Bit 8)                       */
#define SCU_HIBERNATE_LPACTH0_VBATHI_Msk      (0x3f00UL)                /*!< SCU_HIBERNATE LPACTH0: VBATHI (Bitfield-Mask: 0x3f)         */

/* ----------------------------  SCU_HIBERNATE_LPACTH1  --------------------------- */
#define SCU_HIBERNATE_LPACTH1_AHIBIO0LO_Pos   (0UL)                     /*!< SCU_HIBERNATE LPACTH1: AHIBIO0LO (Bit 0)                    */
#define SCU_HIBERNATE_LPACTH1_AHIBIO0LO_Msk   (0x3fUL)                  /*!< SCU_HIBERNATE LPACTH1: AHIBIO0LO (Bitfield-Mask: 0x3f)      */
#define SCU_HIBERNATE_LPACTH1_AHIBIO0HI_Pos   (8UL)                     /*!< SCU_HIBERNATE LPACTH1: AHIBIO0HI (Bit 8)                    */
#define SCU_HIBERNATE_LPACTH1_AHIBIO0HI_Msk   (0x3f00UL)                /*!< SCU_HIBERNATE LPACTH1: AHIBIO0HI (Bitfield-Mask: 0x3f)      */
#define SCU_HIBERNATE_LPACTH1_AHIBIO1LO_Pos   (16UL)                    /*!< SCU_HIBERNATE LPACTH1: AHIBIO1LO (Bit 16)                   */
#define SCU_HIBERNATE_LPACTH1_AHIBIO1LO_Msk   (0x3f0000UL)              /*!< SCU_HIBERNATE LPACTH1: AHIBIO1LO (Bitfield-Mask: 0x3f)      */
#define SCU_HIBERNATE_LPACTH1_AHIBIO1HI_Pos   (24UL)                    /*!< SCU_HIBERNATE LPACTH1: AHIBIO1HI (Bit 24)                   */
#define SCU_HIBERNATE_LPACTH1_AHIBIO1HI_Msk   (0x3f000000UL)            /*!< SCU_HIBERNATE LPACTH1: AHIBIO1HI (Bitfield-Mask: 0x3f)      */

/* ----------------------------  SCU_HIBERNATE_LPACST  ---------------------------- */
#define SCU_HIBERNATE_LPACST_VBATSCMP_Pos     (0UL)                     /*!< SCU_HIBERNATE LPACST: VBATSCMP (Bit 0)                      */
#define SCU_HIBERNATE_LPACST_VBATSCMP_Msk     (0x1UL)                   /*!< SCU_HIBERNATE LPACST: VBATSCMP (Bitfield-Mask: 0x01)        */
#define SCU_HIBERNATE_LPACST_AHIBIO0SCMP_Pos  (1UL)                     /*!< SCU_HIBERNATE LPACST: AHIBIO0SCMP (Bit 1)                   */
#define SCU_HIBERNATE_LPACST_AHIBIO0SCMP_Msk  (0x2UL)                   /*!< SCU_HIBERNATE LPACST: AHIBIO0SCMP (Bitfield-Mask: 0x01)     */
#define SCU_HIBERNATE_LPACST_AHIBIO1SCMP_Pos  (2UL)                     /*!< SCU_HIBERNATE LPACST: AHIBIO1SCMP (Bit 2)                   */
#define SCU_HIBERNATE_LPACST_AHIBIO1SCMP_Msk  (0x4UL)                   /*!< SCU_HIBERNATE LPACST: AHIBIO1SCMP (Bitfield-Mask: 0x01)     */
#define SCU_HIBERNATE_LPACST_VBATVAL_Pos      (16UL)                    /*!< SCU_HIBERNATE LPACST: VBATVAL (Bit 16)                      */
#define SCU_HIBERNATE_LPACST_VBATVAL_Msk      (0x10000UL)               /*!< SCU_HIBERNATE LPACST: VBATVAL (Bitfield-Mask: 0x01)         */
#define SCU_HIBERNATE_LPACST_AHIBIO0VAL_Pos   (17UL)                    /*!< SCU_HIBERNATE LPACST: AHIBIO0VAL (Bit 17)                   */
#define SCU_HIBERNATE_LPACST_AHIBIO0VAL_Msk   (0x20000UL)               /*!< SCU_HIBERNATE LPACST: AHIBIO0VAL (Bitfield-Mask: 0x01)      */
#define SCU_HIBERNATE_LPACST_AHIBIO1VAL_Pos   (18UL)                    /*!< SCU_HIBERNATE LPACST: AHIBIO1VAL (Bit 18)                   */
#define SCU_HIBERNATE_LPACST_AHIBIO1VAL_Msk   (0x40000UL)               /*!< SCU_HIBERNATE LPACST: AHIBIO1VAL (Bitfield-Mask: 0x01)      */

/* ----------------------------  SCU_HIBERNATE_LPACCLR  --------------------------- */
#define SCU_HIBERNATE_LPACCLR_VBATSCMP_Pos    (0UL)                     /*!< SCU_HIBERNATE LPACCLR: VBATSCMP (Bit 0)                     */
#define SCU_HIBERNATE_LPACCLR_VBATSCMP_Msk    (0x1UL)                   /*!< SCU_HIBERNATE LPACCLR: VBATSCMP (Bitfield-Mask: 0x01)       */
#define SCU_HIBERNATE_LPACCLR_AHIBIO0SCMP_Pos (1UL)                     /*!< SCU_HIBERNATE LPACCLR: AHIBIO0SCMP (Bit 1)                  */
#define SCU_HIBERNATE_LPACCLR_AHIBIO0SCMP_Msk (0x2UL)                   /*!< SCU_HIBERNATE LPACCLR: AHIBIO0SCMP (Bitfield-Mask: 0x01)    */
#define SCU_HIBERNATE_LPACCLR_AHIBIO1SCMP_Pos (2UL)                     /*!< SCU_HIBERNATE LPACCLR: AHIBIO1SCMP (Bit 2)                  */
#define SCU_HIBERNATE_LPACCLR_AHIBIO1SCMP_Msk (0x4UL)                   /*!< SCU_HIBERNATE LPACCLR: AHIBIO1SCMP (Bitfield-Mask: 0x01)    */
#define SCU_HIBERNATE_LPACCLR_VBATVAL_Pos     (16UL)                    /*!< SCU_HIBERNATE LPACCLR: VBATVAL (Bit 16)                     */
#define SCU_HIBERNATE_LPACCLR_VBATVAL_Msk     (0x10000UL)               /*!< SCU_HIBERNATE LPACCLR: VBATVAL (Bitfield-Mask: 0x01)        */
#define SCU_HIBERNATE_LPACCLR_AHIBIO0VAL_Pos  (17UL)                    /*!< SCU_HIBERNATE LPACCLR: AHIBIO0VAL (Bit 17)                  */
#define SCU_HIBERNATE_LPACCLR_AHIBIO0VAL_Msk  (0x20000UL)               /*!< SCU_HIBERNATE LPACCLR: AHIBIO0VAL (Bitfield-Mask: 0x01)     */
#define SCU_HIBERNATE_LPACCLR_AHIBIO1VAL_Pos  (18UL)                    /*!< SCU_HIBERNATE LPACCLR: AHIBIO1VAL (Bit 18)                  */
#define SCU_HIBERNATE_LPACCLR_AHIBIO1VAL_Msk  (0x40000UL)               /*!< SCU_HIBERNATE LPACCLR: AHIBIO1VAL (Bitfield-Mask: 0x01)     */

/* ----------------------------  SCU_HIBERNATE_LPACSET  --------------------------- */
#define SCU_HIBERNATE_LPACSET_VBATSCMP_Pos    (0UL)                     /*!< SCU_HIBERNATE LPACSET: VBATSCMP (Bit 0)                     */
#define SCU_HIBERNATE_LPACSET_VBATSCMP_Msk    (0x1UL)                   /*!< SCU_HIBERNATE LPACSET: VBATSCMP (Bitfield-Mask: 0x01)       */
#define SCU_HIBERNATE_LPACSET_AHIBIO0SCMP_Pos (1UL)                     /*!< SCU_HIBERNATE LPACSET: AHIBIO0SCMP (Bit 1)                  */
#define SCU_HIBERNATE_LPACSET_AHIBIO0SCMP_Msk (0x2UL)                   /*!< SCU_HIBERNATE LPACSET: AHIBIO0SCMP (Bitfield-Mask: 0x01)    */
#define SCU_HIBERNATE_LPACSET_AHIBIO1SCMP_Pos (2UL)                     /*!< SCU_HIBERNATE LPACSET: AHIBIO1SCMP (Bit 2)                  */
#define SCU_HIBERNATE_LPACSET_AHIBIO1SCMP_Msk (0x4UL)                   /*!< SCU_HIBERNATE LPACSET: AHIBIO1SCMP (Bitfield-Mask: 0x01)    */
#define SCU_HIBERNATE_LPACSET_VBATVAL_Pos     (16UL)                    /*!< SCU_HIBERNATE LPACSET: VBATVAL (Bit 16)                     */
#define SCU_HIBERNATE_LPACSET_VBATVAL_Msk     (0x10000UL)               /*!< SCU_HIBERNATE LPACSET: VBATVAL (Bitfield-Mask: 0x01)        */
#define SCU_HIBERNATE_LPACSET_AHIBIO0VAL_Pos  (17UL)                    /*!< SCU_HIBERNATE LPACSET: AHIBIO0VAL (Bit 17)                  */
#define SCU_HIBERNATE_LPACSET_AHIBIO0VAL_Msk  (0x20000UL)               /*!< SCU_HIBERNATE LPACSET: AHIBIO0VAL (Bitfield-Mask: 0x01)     */
#define SCU_HIBERNATE_LPACSET_AHIBIO1VAL_Pos  (18UL)                    /*!< SCU_HIBERNATE LPACSET: AHIBIO1VAL (Bit 18)                  */
#define SCU_HIBERNATE_LPACSET_AHIBIO1VAL_Msk  (0x40000UL)               /*!< SCU_HIBERNATE LPACSET: AHIBIO1VAL (Bitfield-Mask: 0x01)     */

