Infineon/mtb-xmclib-cat3/CMSIS/Infineon/COMPONENT_XMC4402/Include/XMC4402.h
/* -------------------------------  USB_EP_DOEPDMA  ------------------------------- */
#define USB_EP_DOEPDMA_DMAAddr_Pos            (0UL)                     /*!< USB_EP DOEPDMA: DMAAddr (Bit 0)                             */
#define USB_EP_DOEPDMA_DMAAddr_Msk            (0xffffffffUL)            /*!< USB_EP DOEPDMA: DMAAddr (Bitfield-Mask: 0xffffffff)         */

/* -------------------------------  USB_EP_DOEPDMAB  ------------------------------ */
#define USB_EP_DOEPDMAB_DMABufferAddr_Pos     (0UL)                     /*!< USB_EP DOEPDMAB: DMABufferAddr (Bit 0)                      */
#define USB_EP_DOEPDMAB_DMABufferAddr_Msk     (0xffffffffUL)            /*!< USB_EP DOEPDMAB: DMABufferAddr (Bitfield-Mask: 0xffffffff)  */


/* ================================================================================ */
/* ================         Group 'USB_CH' Position & Mask         ================ */
/* ================================================================================ */


/* --------------------------------  USB_CH_HCCHAR  ------------------------------- */
#define USB_CH_HCCHAR_MPS_Pos                 (0UL)                     /*!< USB_CH HCCHAR: MPS (Bit 0)                                  */
#define USB_CH_HCCHAR_MPS_Msk                 (0x7ffUL)                 /*!< USB_CH HCCHAR: MPS (Bitfield-Mask: 0x7ff)                   */
#define USB_CH_HCCHAR_EPNum_Pos               (11UL)                    /*!< USB_CH HCCHAR: EPNum (Bit 11)                               */
#define USB_CH_HCCHAR_EPNum_Msk               (0x7800UL)                /*!< USB_CH HCCHAR: EPNum (Bitfield-Mask: 0x0f)                  */
#define USB_CH_HCCHAR_EPDir_Pos               (15UL)                    /*!< USB_CH HCCHAR: EPDir (Bit 15)                               */
#define USB_CH_HCCHAR_EPDir_Msk               (0x8000UL)                /*!< USB_CH HCCHAR: EPDir (Bitfield-Mask: 0x01)                  */
#define USB_CH_HCCHAR_EPType_Pos              (18UL)                    /*!< USB_CH HCCHAR: EPType (Bit 18)                              */
#define USB_CH_HCCHAR_EPType_Msk              (0xc0000UL)               /*!< USB_CH HCCHAR: EPType (Bitfield-Mask: 0x03)                 */
#define USB_CH_HCCHAR_MC_EC_Pos               (20UL)                    /*!< USB_CH HCCHAR: MC_EC (Bit 20)                               */
#define USB_CH_HCCHAR_MC_EC_Msk               (0x300000UL)              /*!< USB_CH HCCHAR: MC_EC (Bitfield-Mask: 0x03)                  */
#define USB_CH_HCCHAR_DevAddr_Pos             (22UL)                    /*!< USB_CH HCCHAR: DevAddr (Bit 22)                             */
#define USB_CH_HCCHAR_DevAddr_Msk             (0x1fc00000UL)            /*!< USB_CH HCCHAR: DevAddr (Bitfield-Mask: 0x7f)                */
#define USB_CH_HCCHAR_OddFrm_Pos              (29UL)                    /*!< USB_CH HCCHAR: OddFrm (Bit 29)                              */
#define USB_CH_HCCHAR_OddFrm_Msk              (0x20000000UL)            /*!< USB_CH HCCHAR: OddFrm (Bitfield-Mask: 0x01)                 */
#define USB_CH_HCCHAR_ChDis_Pos               (30UL)                    /*!< USB_CH HCCHAR: ChDis (Bit 30)                               */
#define USB_CH_HCCHAR_ChDis_Msk               (0x40000000UL)            /*!< USB_CH HCCHAR: ChDis (Bitfield-Mask: 0x01)                  */
#define USB_CH_HCCHAR_ChEna_Pos               (31UL)                    /*!< USB_CH HCCHAR: ChEna (Bit 31)                               */
#define USB_CH_HCCHAR_ChEna_Msk               (0x80000000UL)            /*!< USB_CH HCCHAR: ChEna (Bitfield-Mask: 0x01)                  */

/* --------------------------------  USB_CH_HCINT  -------------------------------- */
#define USB_CH_HCINT_XferCompl_Pos            (0UL)                     /*!< USB_CH HCINT: XferCompl (Bit 0)                             */
#define USB_CH_HCINT_XferCompl_Msk            (0x1UL)                   /*!< USB_CH HCINT: XferCompl (Bitfield-Mask: 0x01)               */
#define USB_CH_HCINT_ChHltd_Pos               (1UL)                     /*!< USB_CH HCINT: ChHltd (Bit 1)                                */
#define USB_CH_HCINT_ChHltd_Msk               (0x2UL)                   /*!< USB_CH HCINT: ChHltd (Bitfield-Mask: 0x01)                  */
#define USB_CH_HCINT_AHBErr_Pos               (2UL)                     /*!< USB_CH HCINT: AHBErr (Bit 2)                                */
#define USB_CH_HCINT_AHBErr_Msk               (0x4UL)                   /*!< USB_CH HCINT: AHBErr (Bitfield-Mask: 0x01)                  */
#define USB_CH_HCINT_STALL_Pos                (3UL)                     /*!< USB_CH HCINT: STALL (Bit 3)                                 */
#define USB_CH_HCINT_STALL_Msk                (0x8UL)                   /*!< USB_CH HCINT: STALL (Bitfield-Mask: 0x01)                   */
#define USB_CH_HCINT_NAK_Pos                  (4UL)                     /*!< USB_CH HCINT: NAK (Bit 4)                                   */
#define USB_CH_HCINT_NAK_Msk                  (0x10UL)                  /*!< USB_CH HCINT: NAK (Bitfield-Mask: 0x01)                     */
#define USB_CH_HCINT_ACK_Pos                  (5UL)                     /*!< USB_CH HCINT: ACK (Bit 5)                                   */
#define USB_CH_HCINT_ACK_Msk                  (0x20UL)                  /*!< USB_CH HCINT: ACK (Bitfield-Mask: 0x01)                     */
#define USB_CH_HCINT_NYET_Pos                 (6UL)                     /*!< USB_CH HCINT: NYET (Bit 6)                                  */
#define USB_CH_HCINT_NYET_Msk                 (0x40UL)                  /*!< USB_CH HCINT: NYET (Bitfield-Mask: 0x01)                    */
#define USB_CH_HCINT_XactErr_Pos              (7UL)                     /*!< USB_CH HCINT: XactErr (Bit 7)                               */
#define USB_CH_HCINT_XactErr_Msk              (0x80UL)                  /*!< USB_CH HCINT: XactErr (Bitfield-Mask: 0x01)                 */
#define USB_CH_HCINT_BblErr_Pos               (8UL)                     /*!< USB_CH HCINT: BblErr (Bit 8)                                */
#define USB_CH_HCINT_BblErr_Msk               (0x100UL)                 /*!< USB_CH HCINT: BblErr (Bitfield-Mask: 0x01)                  */
#define USB_CH_HCINT_FrmOvrun_Pos             (9UL)                     /*!< USB_CH HCINT: FrmOvrun (Bit 9)                              */
#define USB_CH_HCINT_FrmOvrun_Msk             (0x200UL)                 /*!< USB_CH HCINT: FrmOvrun (Bitfield-Mask: 0x01)                */
#define USB_CH_HCINT_DataTglErr_Pos           (10UL)                    /*!< USB_CH HCINT: DataTglErr (Bit 10)                           */
#define USB_CH_HCINT_DataTglErr_Msk           (0x400UL)                 /*!< USB_CH HCINT: DataTglErr (Bitfield-Mask: 0x01)              */
#define USB_CH_HCINT_BNAIntr_Pos              (11UL)                    /*!< USB_CH HCINT: BNAIntr (Bit 11)                              */
#define USB_CH_HCINT_BNAIntr_Msk              (0x800UL)                 /*!< USB_CH HCINT: BNAIntr (Bitfield-Mask: 0x01)                 */
#define USB_CH_HCINT_XCS_XACT_ERR_Pos         (12UL)                    /*!< USB_CH HCINT: XCS_XACT_ERR (Bit 12)                         */
#define USB_CH_HCINT_XCS_XACT_ERR_Msk         (0x1000UL)                /*!< USB_CH HCINT: XCS_XACT_ERR (Bitfield-Mask: 0x01)            */
#define USB_CH_HCINT_DESC_LST_ROLLIntr_Pos    (13UL)                    /*!< USB_CH HCINT: DESC_LST_ROLLIntr (Bit 13)                    */
#define USB_CH_HCINT_DESC_LST_ROLLIntr_Msk    (0x2000UL)                /*!< USB_CH HCINT: DESC_LST_ROLLIntr (Bitfield-Mask: 0x01)       */

/* -------------------------------  USB_CH_HCINTMSK  ------------------------------ */
#define USB_CH_HCINTMSK_XferComplMsk_Pos      (0UL)                     /*!< USB_CH HCINTMSK: XferComplMsk (Bit 0)                       */
#define USB_CH_HCINTMSK_XferComplMsk_Msk      (0x1UL)                   /*!< USB_CH HCINTMSK: XferComplMsk (Bitfield-Mask: 0x01)         */
#define USB_CH_HCINTMSK_ChHltdMsk_Pos         (1UL)                     /*!< USB_CH HCINTMSK: ChHltdMsk (Bit 1)                          */
#define USB_CH_HCINTMSK_ChHltdMsk_Msk         (0x2UL)                   /*!< USB_CH HCINTMSK: ChHltdMsk (Bitfield-Mask: 0x01)            */
#define USB_CH_HCINTMSK_AHBErrMsk_Pos         (2UL)                     /*!< USB_CH HCINTMSK: AHBErrMsk (Bit 2)                          */
#define USB_CH_HCINTMSK_AHBErrMsk_Msk         (0x4UL)                   /*!< USB_CH HCINTMSK: AHBErrMsk (Bitfield-Mask: 0x01)            */
#define USB_CH_HCINTMSK_StallMsk_Pos          (3UL)                     /*!< USB_CH HCINTMSK: StallMsk (Bit 3)                           */
#define USB_CH_HCINTMSK_StallMsk_Msk          (0x8UL)                   /*!< USB_CH HCINTMSK: StallMsk (Bitfield-Mask: 0x01)             */
#define USB_CH_HCINTMSK_NakMsk_Pos            (4UL)                     /*!< USB_CH HCINTMSK: NakMsk (Bit 4)                             */
#define USB_CH_HCINTMSK_NakMsk_Msk            (0x10UL)                  /*!< USB_CH HCINTMSK: NakMsk (Bitfield-Mask: 0x01)               */
#define USB_CH_HCINTMSK_AckMsk_Pos            (5UL)                     /*!< USB_CH HCINTMSK: AckMsk (Bit 5)                             */
#define USB_CH_HCINTMSK_AckMsk_Msk            (0x20UL)                  /*!< USB_CH HCINTMSK: AckMsk (Bitfield-Mask: 0x01)               */
#define USB_CH_HCINTMSK_NyetMsk_Pos           (6UL)                     /*!< USB_CH HCINTMSK: NyetMsk (Bit 6)                            */
#define USB_CH_HCINTMSK_NyetMsk_Msk           (0x40UL)                  /*!< USB_CH HCINTMSK: NyetMsk (Bitfield-Mask: 0x01)              */
#define USB_CH_HCINTMSK_XactErrMsk_Pos        (7UL)                     /*!< USB_CH HCINTMSK: XactErrMsk (Bit 7)                         */
#define USB_CH_HCINTMSK_XactErrMsk_Msk        (0x80UL)                  /*!< USB_CH HCINTMSK: XactErrMsk (Bitfield-Mask: 0x01)           */
#define USB_CH_HCINTMSK_BblErrMsk_Pos         (8UL)                     /*!< USB_CH HCINTMSK: BblErrMsk (Bit 8)                          */
#define USB_CH_HCINTMSK_BblErrMsk_Msk         (0x100UL)                 /*!< USB_CH HCINTMSK: BblErrMsk (Bitfield-Mask: 0x01)            */
#define USB_CH_HCINTMSK_FrmOvrunMsk_Pos       (9UL)                     /*!< USB_CH HCINTMSK: FrmOvrunMsk (Bit 9)                        */
#define USB_CH_HCINTMSK_FrmOvrunMsk_Msk       (0x200UL)                 /*!< USB_CH HCINTMSK: FrmOvrunMsk (Bitfield-Mask: 0x01)          */
#define USB_CH_HCINTMSK_DataTglErrMsk_Pos     (10UL)                    /*!< USB_CH HCINTMSK: DataTglErrMsk (Bit 10)                     */
#define USB_CH_HCINTMSK_DataTglErrMsk_Msk     (0x400UL)                 /*!< USB_CH HCINTMSK: DataTglErrMsk (Bitfield-Mask: 0x01)        */
#define USB_CH_HCINTMSK_BNAIntrMsk_Pos        (11UL)                    /*!< USB_CH HCINTMSK: BNAIntrMsk (Bit 11)                        */
#define USB_CH_HCINTMSK_BNAIntrMsk_Msk        (0x800UL)                 /*!< USB_CH HCINTMSK: BNAIntrMsk (Bitfield-Mask: 0x01)           */
#define USB_CH_HCINTMSK_DESC_LST_ROLLIntrMsk_Pos (13UL)                 /*!< USB_CH HCINTMSK: DESC_LST_ROLLIntrMsk (Bit 13)              */
#define USB_CH_HCINTMSK_DESC_LST_ROLLIntrMsk_Msk (0x2000UL)             /*!< USB_CH HCINTMSK: DESC_LST_ROLLIntrMsk (Bitfield-Mask: 0x01) */

/* --------------------------  USB_CH_HCTSIZ_BUFFERMODE  -------------------------- */
#define USB_CH_HCTSIZ_BUFFERMODE_XferSize_Pos (0UL)                     /*!< USB_CH HCTSIZ_BUFFERMODE: XferSize (Bit 0)                  */
#define USB_CH_HCTSIZ_BUFFERMODE_XferSize_Msk (0x7ffffUL)               /*!< USB_CH HCTSIZ_BUFFERMODE: XferSize (Bitfield-Mask: 0x7ffff) */
#define USB_CH_HCTSIZ_BUFFERMODE_PktCnt_Pos   (19UL)                    /*!< USB_CH HCTSIZ_BUFFERMODE: PktCnt (Bit 19)                   */
#define USB_CH_HCTSIZ_BUFFERMODE_PktCnt_Msk   (0x1ff80000UL)            /*!< USB_CH HCTSIZ_BUFFERMODE: PktCnt (Bitfield-Mask: 0x3ff)     */
#define USB_CH_HCTSIZ_BUFFERMODE_Pid_Pos      (29UL)                    /*!< USB_CH HCTSIZ_BUFFERMODE: Pid (Bit 29)                      */
#define USB_CH_HCTSIZ_BUFFERMODE_Pid_Msk      (0x60000000UL)            /*!< USB_CH HCTSIZ_BUFFERMODE: Pid (Bitfield-Mask: 0x03)         */

/* --------------------------  USB_CH_HCTSIZ_SCATGATHER  -------------------------- */
#define USB_CH_HCTSIZ_SCATGATHER_SCHED_INFO_Pos (0UL)                   /*!< USB_CH HCTSIZ_SCATGATHER: SCHED_INFO (Bit 0)                */
#define USB_CH_HCTSIZ_SCATGATHER_SCHED_INFO_Msk (0xffUL)                /*!< USB_CH HCTSIZ_SCATGATHER: SCHED_INFO (Bitfield-Mask: 0xff)  */
#define USB_CH_HCTSIZ_SCATGATHER_NTD_Pos      (8UL)                     /*!< USB_CH HCTSIZ_SCATGATHER: NTD (Bit 8)                       */
#define USB_CH_HCTSIZ_SCATGATHER_NTD_Msk      (0xff00UL)                /*!< USB_CH HCTSIZ_SCATGATHER: NTD (Bitfield-Mask: 0xff)         */
#define USB_CH_HCTSIZ_SCATGATHER_Pid_Pos      (29UL)                    /*!< USB_CH HCTSIZ_SCATGATHER: Pid (Bit 29)                      */
#define USB_CH_HCTSIZ_SCATGATHER_Pid_Msk      (0x60000000UL)            /*!< USB_CH HCTSIZ_SCATGATHER: Pid (Bitfield-Mask: 0x03)         */

/* ---------------------------  USB_CH_HCDMA_BUFFERMODE  -------------------------- */
#define USB_CH_HCDMA_BUFFERMODE_DMAAddr_Pos   (0UL)                     /*!< USB_CH HCDMA_BUFFERMODE: DMAAddr (Bit 0)                    */
#define USB_CH_HCDMA_BUFFERMODE_DMAAddr_Msk   (0xffffffffUL)            /*!< USB_CH HCDMA_BUFFERMODE: DMAAddr (Bitfield-Mask: 0xffffffff) */

/* ---------------------------  USB_CH_HCDMA_SCATGATHER  -------------------------- */
#define USB_CH_HCDMA_SCATGATHER_CTD_Pos       (3UL)                     /*!< USB_CH HCDMA_SCATGATHER: CTD (Bit 3)                        */
#define USB_CH_HCDMA_SCATGATHER_CTD_Msk       (0x1f8UL)                 /*!< USB_CH HCDMA_SCATGATHER: CTD (Bitfield-Mask: 0x3f)          */
#define USB_CH_HCDMA_SCATGATHER_DMAAddr_Pos   (9UL)                     /*!< USB_CH HCDMA_SCATGATHER: DMAAddr (Bit 9)                    */
#define USB_CH_HCDMA_SCATGATHER_DMAAddr_Msk   (0xfffffe00UL)            /*!< USB_CH HCDMA_SCATGATHER: DMAAddr (Bitfield-Mask: 0x7fffff)  */

/* --------------------------------  USB_CH_HCDMAB  ------------------------------- */
#define USB_CH_HCDMAB_Buffer_Address_Pos      (0UL)                     /*!< USB_CH HCDMAB: Buffer_Address (Bit 0)                       */
#define USB_CH_HCDMAB_Buffer_Address_Msk      (0xffffffffUL)            /*!< USB_CH HCDMAB: Buffer_Address (Bitfield-Mask: 0xffffffff)   */


/* ================================================================================ */
/* ================          Group 'USIC' Position & Mask          ================ */
/* ================================================================================ */


/* -----------------------------------  USIC_ID  ---------------------------------- */
#define USIC_ID_MOD_REV_Pos                   (0UL)                     /*!< USIC ID: MOD_REV (Bit 0)                                    */
#define USIC_ID_MOD_REV_Msk                   (0xffUL)                  /*!< USIC ID: MOD_REV (Bitfield-Mask: 0xff)                      */
#define USIC_ID_MOD_TYPE_Pos                  (8UL)                     /*!< USIC ID: MOD_TYPE (Bit 8)                                   */
#define USIC_ID_MOD_TYPE_Msk                  (0xff00UL)                /*!< USIC ID: MOD_TYPE (Bitfield-Mask: 0xff)                     */
#define USIC_ID_MOD_NUMBER_Pos                (16UL)                    /*!< USIC ID: MOD_NUMBER (Bit 16)                                */
#define USIC_ID_MOD_NUMBER_Msk                (0xffff0000UL)            /*!< USIC ID: MOD_NUMBER (Bitfield-Mask: 0xffff)                 */


/* ================================================================================ */
/* ================         Group 'USIC_CH' Position & Mask        ================ */
/* ================================================================================ */


/* --------------------------------  USIC_CH_CCFG  -------------------------------- */
#define USIC_CH_CCFG_SSC_Pos                  (0UL)                     /*!< USIC_CH CCFG: SSC (Bit 0)                                   */
#define USIC_CH_CCFG_SSC_Msk                  (0x1UL)                   /*!< USIC_CH CCFG: SSC (Bitfield-Mask: 0x01)                     */
#define USIC_CH_CCFG_ASC_Pos                  (1UL)                     /*!< USIC_CH CCFG: ASC (Bit 1)                                   */
#define USIC_CH_CCFG_ASC_Msk                  (0x2UL)                   /*!< USIC_CH CCFG: ASC (Bitfield-Mask: 0x01)                     */
#define USIC_CH_CCFG_IIC_Pos                  (2UL)                     /*!< USIC_CH CCFG: IIC (Bit 2)                                   */
#define USIC_CH_CCFG_IIC_Msk                  (0x4UL)                   /*!< USIC_CH CCFG: IIC (Bitfield-Mask: 0x01)                     */
#define USIC_CH_CCFG_IIS_Pos                  (3UL)                     /*!< USIC_CH CCFG: IIS (Bit 3)                                   */
#define USIC_CH_CCFG_IIS_Msk                  (0x8UL)                   /*!< USIC_CH CCFG: IIS (Bitfield-Mask: 0x01)                     */
#define USIC_CH_CCFG_RB_Pos                   (6UL)                     /*!< USIC_CH CCFG: RB (Bit 6)                                    */
#define USIC_CH_CCFG_RB_Msk                   (0x40UL)                  /*!< USIC_CH CCFG: RB (Bitfield-Mask: 0x01)                      */
#define USIC_CH_CCFG_TB_Pos                   (7UL)                     /*!< USIC_CH CCFG: TB (Bit 7)                                    */
#define USIC_CH_CCFG_TB_Msk                   (0x80UL)                  /*!< USIC_CH CCFG: TB (Bitfield-Mask: 0x01)                      */

/* --------------------------------  USIC_CH_KSCFG  ------------------------------- */
#define USIC_CH_KSCFG_MODEN_Pos               (0UL)                     /*!< USIC_CH KSCFG: MODEN (Bit 0)                                */
#define USIC_CH_KSCFG_MODEN_Msk               (0x1UL)                   /*!< USIC_CH KSCFG: MODEN (Bitfield-Mask: 0x01)                  */
#define USIC_CH_KSCFG_BPMODEN_Pos             (1UL)                     /*!< USIC_CH KSCFG: BPMODEN (Bit 1)                              */
#define USIC_CH_KSCFG_BPMODEN_Msk             (0x2UL)                   /*!< USIC_CH KSCFG: BPMODEN (Bitfield-Mask: 0x01)                */
#define USIC_CH_KSCFG_NOMCFG_Pos              (4UL)                     /*!< USIC_CH KSCFG: NOMCFG (Bit 4)                               */
#define USIC_CH_KSCFG_NOMCFG_Msk              (0x30UL)                  /*!< USIC_CH KSCFG: NOMCFG (Bitfield-Mask: 0x03)                 */
#define USIC_CH_KSCFG_BPNOM_Pos               (7UL)                     /*!< USIC_CH KSCFG: BPNOM (Bit 7)                                */
#define USIC_CH_KSCFG_BPNOM_Msk               (0x80UL)                  /*!< USIC_CH KSCFG: BPNOM (Bitfield-Mask: 0x01)                  */
#define USIC_CH_KSCFG_SUMCFG_Pos              (8UL)                     /*!< USIC_CH KSCFG: SUMCFG (Bit 8)                               */
#define USIC_CH_KSCFG_SUMCFG_Msk              (0x300UL)                 /*!< USIC_CH KSCFG: SUMCFG (Bitfield-Mask: 0x03)                 */
#define USIC_CH_KSCFG_BPSUM_Pos               (11UL)                    /*!< USIC_CH KSCFG: BPSUM (Bit 11)                               */
#define USIC_CH_KSCFG_BPSUM_Msk               (0x800UL)                 /*!< USIC_CH KSCFG: BPSUM (Bitfield-Mask: 0x01)                  */

/* ---------------------------------  USIC_CH_FDR  -------------------------------- */
#define USIC_CH_FDR_STEP_Pos                  (0UL)                     /*!< USIC_CH FDR: STEP (Bit 0)                                   */
#define USIC_CH_FDR_STEP_Msk                  (0x3ffUL)                 /*!< USIC_CH FDR: STEP (Bitfield-Mask: 0x3ff)                    */
#define USIC_CH_FDR_DM_Pos                    (14UL)                    /*!< USIC_CH FDR: DM (Bit 14)                                    */
#define USIC_CH_FDR_DM_Msk                    (0xc000UL)                /*!< USIC_CH FDR: DM (Bitfield-Mask: 0x03)                       */
#define USIC_CH_FDR_RESULT_Pos                (16UL)                    /*!< USIC_CH FDR: RESULT (Bit 16)                                */
#define USIC_CH_FDR_RESULT_Msk                (0x3ff0000UL)             /*!< USIC_CH FDR: RESULT (Bitfield-Mask: 0x3ff)                  */

