Infineon/mtb-xmclib-cat3/CMSIS/Infineon/COMPONENT_XMC4402/Include/XMC4402.h
/* --------------------------------  PORT14_IOCR8  -------------------------------- */
#define PORT14_IOCR8_PC8_Pos                  (3UL)                     /*!< PORT14 IOCR8: PC8 (Bit 3)                                   */
#define PORT14_IOCR8_PC8_Msk                  (0xf8UL)                  /*!< PORT14 IOCR8: PC8 (Bitfield-Mask: 0x1f)                     */
#define PORT14_IOCR8_PC9_Pos                  (11UL)                    /*!< PORT14 IOCR8: PC9 (Bit 11)                                  */
#define PORT14_IOCR8_PC9_Msk                  (0xf800UL)                /*!< PORT14 IOCR8: PC9 (Bitfield-Mask: 0x1f)                     */
#define PORT14_IOCR8_PC10_Pos                 (19UL)                    /*!< PORT14 IOCR8: PC10 (Bit 19)                                 */
#define PORT14_IOCR8_PC10_Msk                 (0xf80000UL)              /*!< PORT14 IOCR8: PC10 (Bitfield-Mask: 0x1f)                    */
#define PORT14_IOCR8_PC11_Pos                 (27UL)                    /*!< PORT14 IOCR8: PC11 (Bit 27)                                 */
#define PORT14_IOCR8_PC11_Msk                 (0xf8000000UL)            /*!< PORT14 IOCR8: PC11 (Bitfield-Mask: 0x1f)                    */

/* --------------------------------  PORT14_IOCR12  ------------------------------- */
#define PORT14_IOCR12_PC12_Pos                (3UL)                     /*!< PORT14 IOCR12: PC12 (Bit 3)                                 */
#define PORT14_IOCR12_PC12_Msk                (0xf8UL)                  /*!< PORT14 IOCR12: PC12 (Bitfield-Mask: 0x1f)                   */
#define PORT14_IOCR12_PC13_Pos                (11UL)                    /*!< PORT14 IOCR12: PC13 (Bit 11)                                */
#define PORT14_IOCR12_PC13_Msk                (0xf800UL)                /*!< PORT14 IOCR12: PC13 (Bitfield-Mask: 0x1f)                   */
#define PORT14_IOCR12_PC14_Pos                (19UL)                    /*!< PORT14 IOCR12: PC14 (Bit 19)                                */
#define PORT14_IOCR12_PC14_Msk                (0xf80000UL)              /*!< PORT14 IOCR12: PC14 (Bitfield-Mask: 0x1f)                   */
#define PORT14_IOCR12_PC15_Pos                (27UL)                    /*!< PORT14 IOCR12: PC15 (Bit 27)                                */
#define PORT14_IOCR12_PC15_Msk                (0xf8000000UL)            /*!< PORT14 IOCR12: PC15 (Bitfield-Mask: 0x1f)                   */

/* ----------------------------------  PORT14_IN  --------------------------------- */
#define PORT14_IN_P0_Pos                      (0UL)                     /*!< PORT14 IN: P0 (Bit 0)                                       */
#define PORT14_IN_P0_Msk                      (0x1UL)                   /*!< PORT14 IN: P0 (Bitfield-Mask: 0x01)                         */
#define PORT14_IN_P1_Pos                      (1UL)                     /*!< PORT14 IN: P1 (Bit 1)                                       */
#define PORT14_IN_P1_Msk                      (0x2UL)                   /*!< PORT14 IN: P1 (Bitfield-Mask: 0x01)                         */
#define PORT14_IN_P2_Pos                      (2UL)                     /*!< PORT14 IN: P2 (Bit 2)                                       */
#define PORT14_IN_P2_Msk                      (0x4UL)                   /*!< PORT14 IN: P2 (Bitfield-Mask: 0x01)                         */
#define PORT14_IN_P3_Pos                      (3UL)                     /*!< PORT14 IN: P3 (Bit 3)                                       */
#define PORT14_IN_P3_Msk                      (0x8UL)                   /*!< PORT14 IN: P3 (Bitfield-Mask: 0x01)                         */
#define PORT14_IN_P4_Pos                      (4UL)                     /*!< PORT14 IN: P4 (Bit 4)                                       */
#define PORT14_IN_P4_Msk                      (0x10UL)                  /*!< PORT14 IN: P4 (Bitfield-Mask: 0x01)                         */
#define PORT14_IN_P5_Pos                      (5UL)                     /*!< PORT14 IN: P5 (Bit 5)                                       */
#define PORT14_IN_P5_Msk                      (0x20UL)                  /*!< PORT14 IN: P5 (Bitfield-Mask: 0x01)                         */
#define PORT14_IN_P6_Pos                      (6UL)                     /*!< PORT14 IN: P6 (Bit 6)                                       */
#define PORT14_IN_P6_Msk                      (0x40UL)                  /*!< PORT14 IN: P6 (Bitfield-Mask: 0x01)                         */
#define PORT14_IN_P7_Pos                      (7UL)                     /*!< PORT14 IN: P7 (Bit 7)                                       */
#define PORT14_IN_P7_Msk                      (0x80UL)                  /*!< PORT14 IN: P7 (Bitfield-Mask: 0x01)                         */
#define PORT14_IN_P8_Pos                      (8UL)                     /*!< PORT14 IN: P8 (Bit 8)                                       */
#define PORT14_IN_P8_Msk                      (0x100UL)                 /*!< PORT14 IN: P8 (Bitfield-Mask: 0x01)                         */
#define PORT14_IN_P9_Pos                      (9UL)                     /*!< PORT14 IN: P9 (Bit 9)                                       */
#define PORT14_IN_P9_Msk                      (0x200UL)                 /*!< PORT14 IN: P9 (Bitfield-Mask: 0x01)                         */
#define PORT14_IN_P10_Pos                     (10UL)                    /*!< PORT14 IN: P10 (Bit 10)                                     */
#define PORT14_IN_P10_Msk                     (0x400UL)                 /*!< PORT14 IN: P10 (Bitfield-Mask: 0x01)                        */
#define PORT14_IN_P11_Pos                     (11UL)                    /*!< PORT14 IN: P11 (Bit 11)                                     */
#define PORT14_IN_P11_Msk                     (0x800UL)                 /*!< PORT14 IN: P11 (Bitfield-Mask: 0x01)                        */
#define PORT14_IN_P12_Pos                     (12UL)                    /*!< PORT14 IN: P12 (Bit 12)                                     */
#define PORT14_IN_P12_Msk                     (0x1000UL)                /*!< PORT14 IN: P12 (Bitfield-Mask: 0x01)                        */
#define PORT14_IN_P13_Pos                     (13UL)                    /*!< PORT14 IN: P13 (Bit 13)                                     */
#define PORT14_IN_P13_Msk                     (0x2000UL)                /*!< PORT14 IN: P13 (Bitfield-Mask: 0x01)                        */
#define PORT14_IN_P14_Pos                     (14UL)                    /*!< PORT14 IN: P14 (Bit 14)                                     */
#define PORT14_IN_P14_Msk                     (0x4000UL)                /*!< PORT14 IN: P14 (Bitfield-Mask: 0x01)                        */
#define PORT14_IN_P15_Pos                     (15UL)                    /*!< PORT14 IN: P15 (Bit 15)                                     */
#define PORT14_IN_P15_Msk                     (0x8000UL)                /*!< PORT14 IN: P15 (Bitfield-Mask: 0x01)                        */

